const LEVEL_TYPES = {
  稳定: [
    { type: '光', count: 210 },
    { type: '冰', count: 210 },
    { type: '火', count: 210 },
    { type: '能量', count: 150 },
    { type: '引力', count: 120 },
    { type: '开放', count: 300 },
  ],
  波动: [
    { type: '光', count: 0 },
    { type: '冰', count: 0 },
    { type: '火', count: 0 },
    { type: '能量', count: 0 },
    { type: '引力', count: 0 },
    { type: '开放', count: 60 },
  ],
};

const DROPDOWN_VALUES = {
  搭档: ['沈星回', '黎深', '祁煜', '秦彻', '夏以昼'],
  搭档身份: [],
  日卡: [],
  阶数: ['I (零阶)', 'II (一阶)', 'III (二阶)', 'IV (三阶)', '无套装'],
  星级: ['三星', '二星', '一星', '零星'],
  武器: ['专武', '重剑', '单手剑', '法杖', '手枪'],
  对谱: ['顺', '逆', '不确定'],
  对谱加成: ['30', '25', '20', '15', '10', '5', '0', '不确定'],
  加成: ['40', '30', '20', '10', '0'],
  沈星回搭档: [
    '暗蚀国王',
    '光猎',
    '逐光骑士',
    '遥远少年',
    'Evol特警',
    '深空猎人',
  ],
  黎深搭档: ['终末之神', '九黎司命', '永恒先知', '极地军医', '黎明抹杀者', '临空医生'],
  祁煜搭档: [
    '利莫里亚海神',
    '潮汐之神',
    '深海潜行者',
    '画坛新锐',
    '海妖魅影',
    '艺术家',
  ],
  秦彻搭档: ['深渊主宰', '无尽掠夺者', '异界来客'],
  夏以昼搭档: ['终极兵器X-02', '远空执舰官', '深空飞行员'],
  沈星回日卡: [
    '夜誓',
    '末夜',
    '逐光',
    '鎏光',
    '睱日',
    '弦光',
    '心晴',
    '匿光',
    '无套装',
  ],
  黎深日卡: ['神谕', '拥雪', '永恒', '终序', '夜色', '静谧', '心晴', '深林', '无套装'],
  祁煜日卡: [
    '雾海',
    '神殿',
    '深海',
    '坠浪',
    '点染',
    '斑斓',
    '心晴',
    '碧海',
    '无套装',
  ],
  秦彻日卡: ['深渊', '掠心', '锋尖', '戮夜', '无套装'],
  夏以昼日卡: ['寂路', '远空', '长昼', '离途', '无套装'],
};

const partnerColors = {
  '黎深': '60, 110, 160', // blue
  '沈星回': '255, 205, 70', // yellow
  '祁煜': '60, 10, 100', // purple
  '秦彻': '170, 0, 40', // red
  '夏以昼': '255, 130, 0', // orange
  '传说中的他': '66, 135, 245'
};

const partnerPhrase = {
  '黎深': '不算加班，毕竟是和你一起',
  '沈星回': '下班了还要打流浪体吗？',
  '祁煜': '给流浪体看看我们的默契',
  '秦彻': '小意思，热身都不够',
  '夏以昼': '休息时就打这个放松？陪你',
  '传说中的他': '我是谁？'
};

const partnerMap = {
  '沈星回': 'xavier',
  '黎深': 'zayne',
  '祁煜': 'rafayle',
  '秦彻': 'sylus',
  '夏以昼': 'caleb',
  '传说中的他': 'unknown'
};

export { LEVEL_TYPES, DROPDOWN_VALUES, partnerColors, partnerPhrase, partnerMap };
